sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
// Read gravity vector
static void read_grv_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_GRV_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}


static void imu_init_values(void)
{
	// Reset all IMU output values
	bno055_config.init_ok = true;
	bno055_config.dev_en = false;
	bno055_config.comp_mask = 0x0F;
	for(uint8_t i = 0; i < 3; i++) {
		bno055_config.gyro_bias[i] = 0;
		bno055_config.accel_bias[i] = 0;
		bno055_config.mag_bias[i] = 0;
		bno055_output.accel[i].val = 0;
		bno055_output.gyro[i].val = 0;
		bno055_output.mag[i].val = 0;
		bno055_output.lia[i].val = 0;
		bno055_output.grv[i].val = 0;
	}
	for(uint8_t i = 0; i < 4; i++) {
		bno055_output.quat[i].val = 0;
		bno055_output.euler[i].val = 0;
	}
	bno055_output.temp.val = 0;
	bno055_output.ts_us = 0;
	
	// Set all IMU configuration values
	bno055_config.g_pwr_mode = NormalG;	// Gyro power mode
	bno055_config.g_scale = GFS_250DPS;	// Gyro full scale
	bno055_config.g_bw = GBW_23Hz;		// Gyro bandwidth
	bno055_config.a_pwr_mode = NormalA;	// Accel power mode
	bno055_config.a_scale = AFS_2G;		// Accel full scale
	bno055_config.a_bw = ABW_31_25Hz;	// Accel bandwidth, accel sample rate divided by ABW_divx
	bno055_config.m_pwr_mode = Normal;	// Select magnetometer power mode
	bno055_config.m_op_mode = Regular;	// Select magnetometer perfomance mode
	bno055_config.m_odr = MODR_10Hz;	// Select magnetometer ODR when in BNO055 bypass mode
	bno055_config.pwr_mode = Normalpwr;	// Select BNO055 power mode
	bno055_config.opr_mode = NDOF;		// specify operation mode for sensors
	bno055_config.dev_calib_done = false;
}

static void imu_startup_device(void)
{
	// Reset device & check which component is present
	NRF_LOG_DEBUG("Device reset!\n\r");
	bno055_reset();
	NRF_LOG_DEBUG("Read WHO AM I registers\n\r");
	bno055_config.comp_mask = bno055_check();
	
	if(bno055_config.comp_mask == 0) {
		NRF_LOG_DEBUG("BNO055 working well\n\r");
		bno055_config.init_ok = true;
		bno055_config.dev_en = true;
	}
	else {
		if(bno055_config.comp_mask == 0x0F) {
			NRF_LOG_DEBUG("BNO055 not working\n\r");
		}
		else if(bno055_config.comp_mask == 0x07) {
			NRF_LOG_DEBUG("BNO055 accelerometer not working.\n\r");
		}
		else if(bno055_config.comp_mask == 0x03) {
			NRF_LOG_DEBUG("BNO055 gyroscope not working.\n\r");
		}
		else if(bno055_config.comp_mask == 0x01){
			NRF_LOG_DEBUG("BNO055 magnetometer not working.\n\r");
		}
		bno055_config.init_ok = true;
		bno055_config.dev_en = true;
	}

	// Read firmware infos & proceed to self-test
	bno055_test();
}


static void imu_calibrate(void)
{
	NRF_LOG_DEBUG("Calibrating BNO055!\n\r");
	
	bno055_calibrate_accel_gyro(bno055_config.accel_bias, bno055_config.gyro_bias);
	NRF_LOG_INFO("Average accelerometer biases (mg). X: " NRF_LOG_FLOAT_MARKER 
				", Y: " NRF_LOG_FLOAT_MARKER 
				", Z: " NRF_LOG_FLOAT_MARKER "\n\r", 
				NRF_LOG_FLOAT(bno055_config.accel_bias[0]), 
				NRF_LOG_FLOAT(bno055_config.accel_bias[1]), 
				NRF_LOG_FLOAT(bno055_config.accel_bias[2]));
	NRF_LOG_INFO("Average gyroscope biases (dps). X: " NRF_LOG_FLOAT_MARKER 
				", Y: " NRF_LOG_FLOAT_MARKER 
				", Z: " NRF_LOG_FLOAT_MARKER "\n\r", 
				NRF_LOG_FLOAT(bno055_config.gyro_bias[0]), 
				NRF_LOG_FLOAT(bno055_config.gyro_bias[1]), 
				NRF_LOG_FLOAT(bno055_config.gyro_bias[2]));

	nrf_delay_ms(1000);
	
	bno055_calibrate_mag(bno055_config.mag_bias);
	NRF_LOG_INFO("Average magnometer biases (mG): X: " NRF_LOG_FLOAT_MARKER
				", Y: " NRF_LOG_FLOAT_MARKER
				", Z: " NRF_LOG_FLOAT_MARKER "\n\r",
				NRF_LOG_FLOAT(bno055_config.mag_bias[0]),
				NRF_LOG_FLOAT(bno055_config.mag_bias[1]),
				NRF_LOG_FLOAT(bno055_config.mag_bias[2]));
				
	nrf_delay_ms(1000);
}


void imu_check_cal(void)
{
	// Read calibration state
	bno055_config.cal_state = readByte(BNO055_ADDRESS, BNO055_CALIB_STAT);
	NRF_LOG_INFO("Not calibrated = 0, fully calibrated = 3\n\r");
	NRF_LOG_INFO("System calibration: %d\n\r",
				((0xC0 & bno055_config.cal_state) >> 6));
	NRF_LOG_INFO("Gyro   calibration: %d\n\r",
				((0x30 & bno055_config.cal_state) >> 4));
	NRF_LOG_INFO("Accel  calibration: %d\n\r",
				((0x0C & bno055_config.cal_state) >> 2));
	NRF_LOG_INFO("Mag    calibration: %d\n\r",
				((0x03 & bno055_config.cal_state) >> 0));
}



void imu_poll_data(uint8_t data_msk)
{
	float pitch, yaw, roll;
	float pitch_raw, yaw_raw, roll_raw;
	float LIAx, LIAy, LIAz, GRVx, GRVy, GRVz;
	float ax, ay, az, gx, gy, gz, mx, my, mz;	// accel/gyro/mag values
	float q[4] = {1.0, 0.0, 0.0, 0.0};    		// vector to hold quaternion
	float q_raw[4] = {1.0, 0.0, 0.0, 0.0};    	// vector to hold quaternion
	float eInt[3] = {0.0, 0.0, 0.0};       		// vector to hold integral error for Mahony method

	if(data_msk & SMS_IMU_DATAMSK_ALL) {
		int16_t data3[3];
		int16_t data4[4];
		
		read_accel_data(data3);
		bno055_output.accel[0].val = (float)data3[0]; // - bno055_config.accel_bias[0];
		bno055_output.accel[1].val = (float)data3[1]; // - bno055_config.accel_bias[1];
		bno055_output.accel[2].val = (float)data3[2]; // - bno055_config.accel_bias[2];
		
		read_gyro_data(data3);
		bno055_output.gyro[0].val = (float)data3[0]; // - bno055_config.gyro_bias[0];
		bno055_output.gyro[1].val = (float)data3[1]; // - bno055_config.gyro_bias[1];
		bno055_output.gyro[2].val = (float)data3[2]; // - bno055_config.gyro_bias[2];
		
		read_mag_data(data3);
		bno055_output.mag[0].val = (float)data3[0]; // - bno055_config.mag_bias[0];
		bno055_output.mag[1].val = (float)data3[1]; // - bno055_config.mag_bias[1];
		bno055_output.mag[2].val = (float)data3[2]; // - bno055_config.mag_bias[2];
		
		read_quat_data(data4);
		bno055_output.quat_raw[0].val = (float)(data4[0]/16384);
		bno055_output.quat_raw[1].val = (float)(data4[1]/16384);
		bno055_output.quat_raw[2].val = (float)(data4[2]/16384);
		bno055_output.quat_raw[3].val = (float)(data4[3]/16384);
		
		read_euler_data(data3);
		bno055_output.euler_raw[0].val = (float)(data3[0]/16); // YAW
		bno055_output.euler_raw[1].val = (float)(data3[1]/16); // ROLL
		bno055_output.euler_raw[2].val = (float)(data3[2]/16); // PITCH
		
