sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
		read_lia_data(data3);
		bno055_output.lia[0].val = (float)data3[0];
		bno055_output.lia[1].val = (float)data3[1];
		bno055_output.lia[2].val = (float)data3[2];
		
		read_grv_data(data3);
		bno055_output.grv[0].val = (float)data3[0];
		bno055_output.grv[1].val = (float)data3[1];
		bno055_output.grv[2].val = (float)data3[2];
	}
	if(data_msk & SMS_IMU_DATAMSK_ACCEL) {
		int16_t data[3];
		read_accel_data(data);  // Read the x/y/z adc values
		// Now we'll calculate the accleration value into actual mg's
		ax = (float)data[0]; // - accelBias[0];  // subtract off calculated accel bias
		ay = (float)data[1]; // - accelBias[1];
		az = (float)data[2]; // - accelBias[2];
		// Fill the sensor output table for later sending
		bno055_output.accel[0].val = ax;
		bno055_output.accel[1].val = ay;
		bno055_output.accel[2].val = az;
		NRF_LOG_DEBUG("Raw acceleration (10^6): %x, %x, %x\n\r",
				(int32_t)(ax*1000000.),
				(int32_t)(ay*1000000.),
				(int32_t)(az*1000000.));
	}
	
	if(data_msk & SMS_IMU_DATAMSK_GYRO) {
		int16_t data[3];
		read_gyro_data(data);  // Read the x/y/z adc values
		// Calculate the gyro value into actual degrees per second
		gx = (float)data[0]/16.; // - gyroBias[0];  // subtract off calculated gyro bias
		gy = (float)data[1]/16.; // - gyroBias[1];  
		gz = (float)data[2]/16.; // - gyroBias[2];  
		// Fill the sensor output table for later sending
		bno055_output.gyro[0].val = gx;
		bno055_output.gyro[1].val = gy;
		bno055_output.gyro[2].val = gz;
		NRF_LOG_DEBUG("Raw gyroscope (10^6)   : %ld, %ld, %ld\n\r",
				(int32_t)(gx*1000000.),
				(int32_t)(gy*1000000.),
				(int32_t)(gz*1000000.));
	}

	if(data_msk & SMS_IMU_DATAMSK_MAG) {
		int16_t data[3];
		read_mag_data(data);  // Read the x/y/z adc values   
		// Calculate the magnetometer values in milliGauss
		mx = (float)data[0]/1.6; // - magBias[0];  // get actual magnetometer value in mGauss 
		my = (float)data[1]/1.6; // - magBias[1];  
		mz = (float)data[2]/1.6; // - magBias[2];   
		// Fill the sensor output table for later sending
		bno055_output.mag[0].val = mx;
		bno055_output.mag[1].val = my;
		bno055_output.mag[2].val = mz;
		NRF_LOG_DEBUG("Raw magnetometer (10^6): %ld, %ld, %ld\n\r",
				(int32_t)(mx*1000000.),
				(int32_t)(my*1000000.),
				(int32_t)(mz*1000000.));
	}
    
	if(data_msk & SMS_IMU_DATAMSK_QUAT) {
		float q[4];
		int16_t data[4];
		read_quat_data(data);  // Read the x/y/z adc values   
		// Calculate the quaternion values  
		q[0] = (float)(data[0])/16384.;    
		q[1] = (float)(data[1])/16384.;  
		q[2] = (float)(data[2])/16384.;   
		q[3] = (float)(data[3])/16384.;   
		// Fill the sensor output table for later sending
		bno055_output.quat[0].val = q[0];
		bno055_output.quat[1].val = q[1];
		bno055_output.quat[2].val = q[2];
		bno055_output.quat[3].val = q[3];
		NRF_LOG_DEBUG("Raw quaternions (10^6) : %ld, %ld, %ld, %ld\n\r",
				(int32_t)(q[0]*1000000.),
				(int32_t)(q[1]*1000000.),
				(int32_t)(q[2]*1000000.),
				(int32_t)(q[3]*1000000.));
	}
	
	if(data_msk & SMS_IMU_DATAMSK_EULER) {
		float yaw, roll, pitch;
		int16_t data[3];
		read_euler_data(data);  // Read the x/y/z adc values   
		// Calculate the Euler angles values in degrees
		yaw = (float)data[0]/16.;  
		roll = (float)data[1]/16.;  
		pitch = (float)data[2]/16.;   
		// Fill the sensor output table for later sending
		bno055_output.euler[0].val = yaw;
		bno055_output.euler[1].val = pitch;
		bno055_output.euler[2].val = roll;
		for(int i = 0; i < 4; i++) {
			bno055_output.euler[3].b[i] = 0xff;
		}
		NRF_LOG_DEBUG("Raw euler angles (10^6): %ld, %ld, %ld\n\r",
				(int32_t)(yaw*1000000.),
				(int32_t)(roll*1000000.),
				(int32_t)(pitch*1000000.));
	}
	
	if(data_msk & SMS_IMU_DATAMSK_LIA) {
		float lia[3];
		int16_t data[3];
		read_lia_data(data);  // Read the x/y/z adc values   
		// Calculate the linear acceleration (sans gravity) values in mg
		lia[0] = (float)data[0];  
		lia[1] = (float)data[1];  
		lia[2] = (float)data[2];   
		// Fill the sensor output table for later sending
		bno055_output.lia[0].val = lia[0];
		bno055_output.lia[1].val = lia[1];
		bno055_output.lia[2].val = lia[2];
		NRF_LOG_DEBUG("Raw LIA (10^6)         : %ld, %ld, %ld\n\r",
				(int32_t)(lia[0]*1000000.),
				(int32_t)(lia[1]*1000000.),
				(int32_t)(lia[2]*1000000.));
	}
	
	if(data_msk & SMS_IMU_DATAMSK_GRV) {
		float grv[3];
		int16_t data[3];
		read_grv_data(data);  // Read the x/y/z adc values   
		// Calculate the linear acceleration (sans gravity) values in mg
		grv[0] = (float)data[0];  
		grv[1] = (float)data[1];  
		grv[2] = (float)data[2];   
		// Fill the sensor output table for later sending
		bno055_output.grv[0].val = grv[0];
		bno055_output.grv[1].val = grv[1];
		bno055_output.grv[2].val = grv[2];
		NRF_LOG_DEBUG("Raw gravity (10^6)     : %ld, %ld, %ld\n\r",
				(int32_t)(grv[0]*1000000.),
				(int32_t)(grv[1]*1000000.),
				(int32_t)(grv[2]*1000000.));
	}
	
	//Chose (once) between unprecise but low-power ms app timer
	// and precise current-demanding us drv timer 
//	static uint32_t last_time_ms = 0;
//	uint32_t now_ms = app_timer_cnt_get();
//	uint32_t delta_ms = (now_ms - last_time_ms)/33;
//	last_time_ms = now_ms;
//	static uint32_t last_time_us = 0;
//	uint32_t delta_us;
//	uint32_t now_us = nrf_drv_timer_capture(&TIMER_DELTA_US, NRF_TIMER_CC_CHANNEL0);
//	if(now_us > last_time_us) {
//		delta_us = now_us - last_time_us;
//	}
//	else {
//		delta_us = 0xFFFFFFFF - last_time_us + now_us;
//	}
//	last_time_us = now_us;
//	// Fill the sensor output table for later sending
//	bno055_output.ts_us = now_us;
//	NRF_LOG_INFO("Timestamp/Delta (us)   : %ld/%ld\n\r", bno055_output.ts_us, delta_us);
	
//	bno055_interrupt.rts = true;
	bno055_interrupt.rts = false;
}

static void imu_init_device(void)
{
   // Select BNO055 config mode
   writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
   nrf_delay_ms(25);
   // Select page 1 to configure sensors
   writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x01);
   // Configure ACC
   writeByte(BNO055_ADDRESS, BNO055_ACC_CONFIG, bno055_config.a_pwr_mode << 5 | bno055_config.a_bw << 2 | bno055_config.a_scale);
   // Configure GYR
   writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_0, bno055_config.g_bw << 3 | bno055_config.g_scale );
   writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_1, bno055_config.g_pwr_mode);
   // Configure MAG
   writeByte(BNO055_ADDRESS, BNO055_MAG_CONFIG, bno055_config.m_pwr_mode << 5 | bno055_config.m_op_mode << 3 | bno055_config.m_odr );
   
   // Select page 0 to read sensors
   writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x00);

   // Select BNO055 gyro temperature source 
   writeByte(BNO055_ADDRESS, BNO055_TEMP_SOURCE, 0x01 );

   // Select BNO055 sensor units (temperature in degrees C, rate in dps, accel in mg)
   writeByte(BNO055_ADDRESS, BNO055_UNIT_SEL, 0x01 );
   
   // Select BNO055 system power mode
   writeByte(BNO055_ADDRESS, BNO055_PWR_MODE, bno055_config.pwr_mode);
 
   // Select BNO055 system operation mode
   writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, bno055_config.opr_mode);
   nrf_delay_ms(25);
}

/* imu_enable works after the following procedure:
 * 1. switch on IMU supply
 * 2. reset all output and prepare the configuration values
 * 3. startup device and check if all parts work correctly (WHO_I_AM)
 * 4. calibrate first accel/gyro, then magneto
 * 5. read calibration values (0 - 3)
 * 6. write the configuration values into IMU registers
 */
void imu_enable(void)
{
	// Switching on IMU supply
	nrf_gpio_pin_write(SMS_IMU_SUPPLY_PIN, SMS_IMU_SW_ON);
	nrf_delay_ms(20);
	// Initialize all IMU values
	imu_init_values();
	// Startup IMU hardware
	NRF_LOG_DEBUG("Starting IMU\n\r");
	imu_startup_device();
	
	NRF_LOG_INFO("BNO055 enabled? %d\r\n\n", bno055_config.dev_en);
	if(bno055_config.dev_en) {
//		imu_calibrate();
//		imu_check_cal();
		imu_init_device();
		NRF_LOG_INFO("BNO055 initialized for sensor mode\n\r");
	}
}
